{
  "kubernetes-cluster.md": "This is the story of when I was a young, innocent programmer. Fancy buzzwords like *Kubernetes*, *Docker*, and *Firebase* sounded magical to me — so of course, I had to use them.\n\nIn the summer of 2024, I was tasked with scraping data of about 6,600 doctors from **Practo.com** (an online healthcare platform where doctors and clinics are listed). One of my professors needed this data for a survey. The initial problem statement was simple:\n\n> Scrape doctor data from 6 cities across 6 specializations. (That's 36 queries total.)\n\n## Initial Approach\n\nThis looked like a straightforward task. Just reverse-engineer Practo's APIs, loop through those 36 queries, save the results as JSON, and merge them later. I had done API reverse-engineering before, so this didn't feel like a challenge.\n\nSo I wrote the code.\n\n![Code screenshot](./kubernetes/ray-so-export.png)\n*(Yes, I used `let` instead of `var` for `response` — I was young.)*\n\nI ran it. Within 2 minutes, Practo rate-limited me.\n\n**Challenge #1: How do I bypass this rate limit?**\n\nMy \"lazy\" solution: rerun the code whenever it crashed. Steve Jobs once said he'd only hire lazy people because they find shortcuts. I told myself this was one of those moments.\n\nIt *kinda* worked. But scraping all 6,600 doctors took two full days. Each API call only returned 10 doctors at a time — paginated. Those two days were hell. I had to babysit my laptop to make sure the program didn't stop. My poor laptop worked nonstop for 48 hours.\n\nI gave the data to my professor. A few weeks later, she came back:\n\n> \"Now scrape reviews for each doctor.\"\n\nAlarm bells. That meant 6,600 API calls — ten times more than before. By proportion, this would take **20 days**. For 20 days, my laptop couldn't shut down, couldn't unplug, couldn't rest. That wasn't sustainable.\n\nI asked my college CS department if I could SSH into one of their lab computers. They refused, giving me one of their Windows 10 computers. Luckily, my professor managed to arrange 5 lab PCs for me — but I had to physically go there to check progress. Pain.\n\nThen I stumbled upon [this video by Harkirat Singh](https://www.youtube.com/watch?v=v06AYk-MnQ). He had a similar issue with scraping and rate limits. His solution? **Master–Worker architecture**: workers (any machine) take jobs from a master, possibly for a reward.\n\nI thought: *Perfect! I'll get workers from AWS EKS. Master can be a Firebase serverless function. Data in Firestore.*\n\nHere's what I built:\n\n![Architecture diagram](./kubernetes/Screenshot%20from%202025-10-04%2022-44-41.png)\n\nThe DB stored `doctorId` and `isReviewScraped`. Workers asked the master for tasks, and the master assigned pending ones.\n\n**Optimization:** Instead of sending one task per request, I batched 30 tasks to reduce latency.\n\nI separated master and worker logic, dockerized the worker, pushed it to Docker Hub, deployed the master on Firebase (with `minInstances = 1` to avoid cold starts). Then I wrote `deployment.yaml`, spun up an **EKS cluster with 16 t2 instances**, and hit \"Deploy.\"\n\nTo my surprise, all data was scraped in ~4 hours. From 20 days → 4 hours. I felt victorious.\n\nNext day, AWS sent me a ₹1700 (~$20) bill. My professor happily paid. I thought this was costly.\n\nSo why is this post titled the way it is?\n\n## The Plot Twist\n\nWe had to repeat scraping every week for different cities. One day, while reading logs, I noticed something weird:\n\nMultiple workers were scraping the **same doctorId**. Then I realized **all workers were scraping all doctorIds**.\n\nThat meant:\n\n* A **single EC2 instance** could've done the entire job in 4 hours.\n* My laptop took 2 days, but EC2 only 4 hours. Why?\n* If rate limits were IP-based, why did EC2 scale so much better?\n\nSo many questions.\n\n## The Answer\n\nTurns out Firestore was the culprit. It suffered from **race conditions**.\n\nNetwork variance between identical EC2 instances is minimal. So when multiple workers requested tasks almost simultaneously (`Δt < 250ms` by my guess), Firestore lagged in propagating updates (~1s delay). Result: the same tasks were handed out multiple times.\n\nIn short: Firestore isn't built for this type of locking.\n\n## The (Real) Solution\n\n* Firebase has no built-in locking.\n* Serverless functions are stateless, so semaphores don't help.\n* Trying to implement semaphores in Firestore just led to more race conditions.\n\nOnly real solution: **SQL databases**. They have built-in locks. No nonsense.\n\n## But Why Was One EC2 Instance Faster Than My Laptop?\n\nMy laptop's bandwidth was shared between scraping, YouTube, browsing, maybe some gaming. All those micro-delays added up. The EC2 instance had a dedicated, stable network — hence much faster scraping.\n\n---\n\n### Lessons learned\n\nI learned that before scaling up your architecture, you should first make sure there are no inefficiencies in the current setup. In my case, I could have achieved the same ~4-hour performance by simply renting a single EC2 instance — at a much lower cost and without the hassle of setting up an entire EKS cluster.",
  "ai-vibe-coding.md": "I've been heavily using AI in my projects for the last three months. From ChatGPT's web app to agent modes in Cursor. I've developed some strong opinions about where AI should and *shouldn't* be used.\n\n---\n\n## Where AI **Shouldn't** Be Used\n\nIf you're building software that will have more than one user, you shouldn't vibe code.\n\nTwo months ago, my brother asked me to create a simple mobile app. It was basically a todo app but with custom logic, reminders, and categorization. It had just 3 screens:\n\n1.  Todos listed in categories with checkboxes (reset every 24 hours).\n2.  Clicking a category shows all todos in that category (todos can be updated/deleted here).\n3.  A screen to add more categories.\n\nPretty simple, right?\n\nI tried completely vibe coding this app without writing a single line myself. I used Cursor. It *kinda* worked, but the app was super buggy. It didn't even \"logically reason\" that todos needed to be saved. There were many such silly bugs. which I don't remember.\n\nYou could say I was lazy with prompting. I literally typed things like:\n> \"Please save stuff man!!\"\n\n…and expected AI to just figure it out.\n\nWhen I finally looked at the codebase, it was an **absolute shitshow**.\n\n![img1](./ai-vibe-coding/img1.png)\n*(634 fucking lines in `index.tsx`)*\n\n![img2](./ai-vibe-coding/img2.png)\n*(8 `useState` declarations in one place)*\n\nPlease bring me tissue paper, I'm crying 😭. For such a simple app, this was the amount of chaos I had to see.\n\n---\n\n## Where AI **Can/Should** Be Used\n\n### Use Case 1: Debugging\n\nLet's say you hit a bug in an unknown territory, or you're just too lazy to debug it. This is where AI shines.\n\nAsk Cursor:\n> \"Hey, I'm facing this bug. These are the steps to reproduce it.\"\n\nIt'll scan your codebase and tell you the reason. But then — **stop there**. Don't let Cursor solve the bug. AI solutions often don't remove the root cause.\n\nUse your own brain (yes, the same brain you use to prompt) to fix the issue properly.\n\n---\n\n### Use Case 2: UI Generation\n\nThis works great for small to medium projects. AI is *very good* at building UI.\n\nWith just a single prompt, it can generate a usable interface. My sweet spot:\n- I describe the UI (layout, elements, state interactions).\n- AI writes the JSX and CSS.\n- I handle the actual JS logic (API calls, state management etc).\n\n![img3](./ai-vibe-coding/img3.png)\n\nThe screenshot above is from my site [khushalsindhav.com](https://khushalsindhav.com), **completely made by AI**. It took ~12 prompts in total. I was literally playing Counter-Strike 2 while AI coded for me.\n\nBonus: I got responsive pages done in ~3 prompts each. 🤯\n\n---\n\n### Use Case 3: Tab Completion (Very Important!)\n\nAlways use Cursor's tab complete. I realized I can't live without it.\n\nMy Cursor subscription ended 2 days ago. I thought, \"let's try coding without it — after all, ₹1700 ($20) is expensive.\"\n\nDay 1: I was building my portfolio site in React. React is bread and butter for me. I didn't *struggle*, but I noticed my productivity drop to about **0.8x**. Honestly, I expected it to drop to 0.5x. The smaller drop was because most of the time I was writing CSS, where tab completion doesn't help much.\n\nDay 2: I was working on a React Native project. I'm not as familiar with React Native. My productivity dropped **3–4x**. Even in React, I'm sure it would've been at least 2x slower.\n\nWhy? Because every time I created a new file like `Component.tsx`, I had to manually write things like:\n\n```tsx\nimport React from \"react\";\nimport { Text, View } from \"react-native\";\n\nexport default function Component() {\n  return <View><Text>Hello</Text></View>;\n}\n```\n\n## How will I use AI now?\n\n1.  Cursor Tab Complete -> Must have\n2.  Agent mode to do some easy changes. I will carefully review this changes.\n3.  Agent mode to scaffold UI.\n4.  Vibe Coding for Projects I can't justify giving time but still want to do.",
  "smart-dumb.md": "Throughout my 21 years of existence, I have met a lot of really smart people who had dumb characteristics. I will be sharing my experience in this blog. I will keep updating this blog as and when new points come to my mind.\n\nLet's assume Mr. X is a smart dumb person.*\n\n## Being selfish\n\nWhen an average classmate asks Mr. X for help, he thinks, 'Why should I help the dumbest person in class? What will I get in return?' Mr. X is gatekeeping his knowledge with his status. Whoever chooses to be friends with Mr. X will not be his real friend. They will have their own motivation (probably grades), and when their goal is fulfilled, they won't help Mr. X back when he is in need.\n\nWhereas if Mr. X had been the smartest person in the class AND if he had had to talk to/help everyone in the class, then he would be a likeable person. Everyone will stand for Mr. X when he is in trouble. Mr. X will be the person whom people will remember even after school/university.\n\nMany of my best friends weren't the smartest people in the class. But they are the best people whom I would choose to hang out with.*\n\n## Not doing things for the end outcome\n\nMost people today do things for the end outcome. Ask a random 12th grader in India, \"Which engineering do you want to do?\" You will hear \"computer science engineering.\" \"Why do you want to do Computer Science\" \"uhhh..uhhh .…₹50 LPA package.\" It's not the student's fault. Coaching institutes and education influencers are selling promises like, \"Join our institute, and we will prepare you for JEE Advance, and your son will be able to crack a 50 LPA package from Google.\" It's the parent's fault. They are grownups. They should know if their child isn't interested in computer science, he won't be able to get a ₹50 LPA package even if Alan Turing teaches the child personally.\n\nEven if the child is able to get a ₹50 LPA package, if your sole motivation was money, chances are you won't be very happy. Your 1/3rd life will be at the office. Let's say your career is about 30 years. This means 10 years straight, day and night, will be spent in the office. Would you want to give 10 years of your life doing something that you don't care about or hate?\n\nI have mainly 2 achievements in my life—clearing JEE and getting a job. For both these achievements, my goal wasn't to get AIR``. During JEE, I was curious to learn more in math and physics. I was the person who knew the derivation of all formulas (for context: derivation wasn't given importance since it isn't asked in JEE). For the software engineer job, I was passionate about building some cool shit. I chose the unorthodox path to not do LeetCode at all. Many of my friends have more packages than me because they did DSA. But it doesn't matter to me. If my current job had offered me 1/2 the current salary, I would have still delivered the same level of work as I am delivering now. Why? Because I like what I am doing.\n\nThis mindset has helped me to rarely get burned out and enjoy work more.*\n\n## Not being Jealous\n\nWe have all been jealous at some point when our friend gets better grades or receives more appreciation from the manager. Over time, I have learned to get less jealous. Now, if any of my friends get something better than me, I am a part of their celebration. There are 8 billion people in this world. There will always be someone better than you. How many times will you be more upset than the other person that they have something that you don't? For me, life is too short to be jealous. You yourself will feel good when your friends really wish you 'best of luck' for something you are doing.*\n\n## Being Curious\n\nI have seen some really smart people who refuse to learn anything outside the syllabus, who will not think about anything outside the syllabus, and who will not venture out to explore something outside their tech stack that is required for the job.\n\nOne of my biggest fears about staying here in Bangalore is that I might have surrounded myself with only tech people. I want to talk with people outside of tech—finance, medical, law, etc. Being curious has always helped me. I can't express how… but I know I have enjoyed being curious. You can fucking talk to me about anything, and I will be interested in listening to you. The only condition is that you should be passionate about the thing that you are talking about.*\n"
}